Case1_3DCS49_FineMesh_kEpsilon/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     overSedDymFoam_rbgh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         15; //2

deltaT          1.e-6; //1.e-4;

writeControl    adjustableRunTime;

writeInterval   0.1; //0.25; //0.2

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.1;

maxAlphaCo      0.1;

maxDeltaT       1e-4;

libs (
    "libgroovyBC.so"
    "libgroovyStandardBCs.so"
  //"libincompressibleRASModels.so"
    "libincompressibleTurbulenceModels.so"
   // "libmyincompressibleRASModels.so"
);

functions
{
    
forcesSed
{
    type          forcesSed;

    libs          (forcesSed);

    writeControl  timeStep;
    timeInterval  1;
    patches       ("cylinder");
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        1100.0; // Redundant for incompressible
    origin (0 0 0); 
    coordinateRotation
        {
            type            axesRotation;
            e3              (0 0 1);
            e1              (1 0 0);
        }
}

}

OptimisationSwitches
    {
      //- Parallel IO file handler
      // uncollated (default), collated or masterUncollated
      fileHandler collated;

      //- collated: thread buffer size for queued file writes.
      // If set to 0 or not sufficient for the file size threading is not used.
      // Default: 2e9
      maxThreadFileBufferSize 0;

      //- masterUncollated: non-blocking buffer size.
      // If the file exceeds this buffer size scheduled transfer is used.
      // Default: 2e9
      maxMasterFileBufferSize 2e9;
    }

// ************************************************************************* //


