Case1_3DCS49_FineMesh_kEpsilon/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // piece 1
    ( -0.7000000000  -0.4600000000  0.1585660172 ) // 0
    ( -0.1060660172  -0.4600000000  0.1585660172 ) // 1
    ( -0.1060660172  -0.1600000000  0.1585660172 ) // 2
    ( -0.7000000000  -0.1600000000  0.1585660172 ) // 3
    ( -0.7000000000  -0.4600000000  0.5000000000 ) // 4
    ( -0.1060660172  -0.4600000000  0.5000000000 ) // 5
    ( -0.1060660172  -0.1600000000  0.5000000000 ) // 6
    ( -0.7000000000  -0.1600000000  0.5000000000 ) // 7

    ( 0.1060660172  -0.4600000000  0.1585660172 ) // 8
    ( 0.7000000000  -0.4600000000  0.1585660172 ) // 9
    ( 0.7000000000  -0.1600000000  0.1585660172 ) // 10
    ( 0.1060660172  -0.1600000000  0.1585660172 ) // 11
    ( 0.1060660172  -0.4600000000  0.5000000000 ) // 12
    ( 0.7000000000  -0.4600000000  0.5000000000 ) // 13
    ( 0.7000000000  -0.1600000000  0.5000000000 ) // 14
    ( 0.1060660172  -0.1600000000  0.5000000000 ) // 15

    ( 0.1060660172  -0.4600000000  -0.3000000000 ) // 16
    ( 0.7000000000  -0.4600000000  -0.3000000000 ) // 17
    ( 0.7000000000  -0.1600000000  -0.3000000000 ) // 18
    ( 0.1060660172  -0.1600000000  -0.3000000000 ) // 19
    ( 0.1060660172  -0.4600000000  -0.0535660172 ) // 20
    ( 0.7000000000  -0.4600000000  -0.0535660172 ) // 21
    ( 0.7000000000  -0.1600000000  -0.0535660172 ) // 22
    ( 0.1060660172  -0.1600000000  -0.0535660172 ) // 23

    ( -0.7000000000  -0.4600000000  -0.3000000000 ) // 24
    ( -0.1060660172  -0.4600000000  -0.3000000000 ) // 25
    ( -0.1060660172  -0.1600000000  -0.3000000000 ) // 26
    ( -0.7000000000  -0.1600000000  -0.3000000000 ) // 27
    ( -0.7000000000  -0.4600000000  -0.0535660172 ) // 28
    ( -0.1060660172  -0.4600000000  -0.0535660172 ) // 29
    ( -0.1060660172  -0.1600000000  -0.0535660172 ) // 30
    ( -0.7000000000  -0.1600000000  -0.0535660172 ) // 31

    ( -0.0371231060  -0.4600000000  0.0896231060 ) // 32
    ( 0.0371231060  -0.4600000000  0.0896231060 ) // 33
    ( 0.0371231060  -0.1600000000  0.0896231060 ) // 34
    ( -0.0371231060  -0.1600000000  0.0896231060 ) // 35

    ( -0.0371231060  -0.4600000000  0.0153768940 ) // 36
    ( 0.0371231060  -0.4600000000  0.0153768940 ) // 37
    ( 0.0371231060  -0.1600000000  0.0153768940 ) // 38
    ( -0.0371231060  -0.1600000000  0.0153768940 ) // 39

    ( -0.0212132034  -0.4600000000  0.0737132034 ) // 40
    ( 0.0212132034  -0.4600000000  0.0737132034 ) // 41
    ( 0.0212132034  -0.1600000000  0.0737132034 ) // 42
    ( -0.0212132034  -0.1600000000  0.0737132034 ) // 43

    ( -0.0212132034  -0.4600000000  0.0312867966 ) // 44
    ( 0.0212132034  -0.4600000000  0.0312867966 ) // 45
    ( 0.0212132034  -0.1600000000  0.0312867966 ) // 46
    ( -0.0212132034  -0.1600000000  0.0312867966 ) // 47

    // piece 3
    ( -0.7000000000  0.1600000000  0.1585660172 ) // 48
    ( -0.1060660172  0.1600000000  0.1585660172 ) // 49
    ( -0.1060660172  0.4600000000  0.1585660172 ) // 50
    ( -0.7000000000  0.4600000000  0.1585660172 ) // 51
    ( -0.7000000000  0.1600000000  0.5000000000 ) // 52
    ( -0.1060660172  0.1600000000  0.5000000000 ) // 53
    ( -0.1060660172  0.4600000000  0.5000000000 ) // 54
    ( -0.7000000000  0.4600000000  0.5000000000 ) // 55

    ( 0.1060660172  0.1600000000  0.1585660172 ) // 56
    ( 0.7000000000  0.1600000000  0.1585660172 ) // 57
    ( 0.7000000000  0.4600000000  0.1585660172 ) // 58
    ( 0.1060660172  0.4600000000  0.1585660172 ) // 59
    ( 0.1060660172  0.1600000000  0.5000000000 ) // 60
    ( 0.7000000000  0.1600000000  0.5000000000 ) // 61
    ( 0.7000000000  0.4600000000  0.5000000000 ) // 62
    ( 0.1060660172  0.4600000000  0.5000000000 ) // 63

    ( 0.1060660172  0.1600000000  -0.3000000000 ) // 64
    ( 0.7000000000  0.1600000000  -0.3000000000 ) // 65
    ( 0.7000000000  0.4600000000  -0.3000000000 ) // 66
    ( 0.1060660172  0.4600000000  -0.3000000000 ) // 67
    ( 0.1060660172  0.1600000000  -0.0535660172 ) // 68
    ( 0.7000000000  0.1600000000  -0.0535660172 ) // 69
    ( 0.7000000000  0.4600000000  -0.0535660172 ) // 70
    ( 0.1060660172  0.4600000000  -0.0535660172 ) // 71

    ( -0.7000000000  0.1600000000  -0.3000000000 ) // 72
    ( -0.1060660172  0.1600000000  -0.3000000000 ) // 73
    ( -0.1060660172  0.4600000000  -0.3000000000 ) // 74
    ( -0.7000000000  0.4600000000  -0.3000000000 ) // 75
    ( -0.7000000000  0.1600000000  -0.0535660172 ) // 76
    ( -0.1060660172  0.1600000000  -0.0535660172 ) // 77
    ( -0.1060660172  0.4600000000  -0.0535660172 ) // 78
    ( -0.7000000000  0.4600000000  -0.0535660172 ) // 79

    ( -0.0371231060  0.1600000000  0.0896231060 ) // 80
    ( 0.0371231060  0.1600000000  0.0896231060 ) // 81
    ( 0.0371231060  0.4600000000  0.0896231060 ) // 82
    ( -0.0371231060  0.4600000000  0.0896231060 ) // 83

    ( -0.0371231060  0.1600000000  0.0153768940 ) // 84
    ( 0.0371231060  0.1600000000  0.0153768940 ) // 85
    ( 0.0371231060  0.4600000000  0.0153768940 ) // 86
    ( -0.0371231060  0.4600000000  0.0153768940 ) // 87

    ( -0.0212132034  0.1600000000  0.0737132034 ) // 88
    ( 0.0212132034  0.1600000000  0.0737132034 ) // 89
    ( 0.0212132034  0.4600000000  0.0737132034 ) // 90
    ( -0.0212132034  0.4600000000  0.0737132034 ) // 91

    ( -0.0212132034  0.1600000000  0.0312867966 ) // 92
    ( 0.0212132034  0.1600000000  0.0312867966 ) // 93
    ( 0.0212132034  0.4600000000  0.0312867966 ) // 94
    ( -0.0212132034  0.4600000000  0.0312867966 ) // 95
);

blocks
(
    // piece 1
    hex ( 0 1 2 3 4 5 6 7 ) ( 60 60 45 ) simpleGrading ( 0.3923717513 0.4346884374 1.9071431203 ) // hex1
    hex ( 8 9 10 11 12 13 14 15 ) ( 60 60 45 ) simpleGrading ( 2.5486034526 0.4346884374 1.9071431203 ) // hex2
    hex ( 16 17 18 19 20 21 22 23 ) ( 60 60 35 ) simpleGrading ( 2.5486034526 0.4346884374 0.5854299325 ) // hex3
    hex ( 24 25 26 27 28 29 30 31 ) ( 60 60 35 ) simpleGrading ( 0.3923717513 0.4346884374 0.5854299325 ) // hex4

    hex ( 1 8 11 2 5 12 15 6 ) ( 41 60 45 ) simpleGrading ( 1.0000000000 0.4346884374 1.9071431203 ) // hex5
    hex ( 20 21 22 23 8 9 10 11 ) ( 60 60 41 ) simpleGrading ( 2.5486034526 0.4346884374 1.0000000000 ) // hex6
    hex ( 25 16 19 26 29 20 23 30 ) ( 41 60 35 ) simpleGrading ( 1.0000000000 0.4346884374 0.5854299325 ) // hex7
    hex ( 28 29 30 31 0 1 2 3 ) ( 60 60 41 ) simpleGrading ( 0.3923717513 0.4346884374 1.0000000000 ) // hex8

    hex ( 32 33 34 35 1 8 11 2 ) ( 41 60 28 ) simpleGrading ( 1.0000000000 0.4346884374 2.7655221204 ) // hex9
    hex ( 37 20 23 38 33 8 11 34 ) ( 28 60 41 ) simpleGrading ( 2.7655221204 0.4346884374 1.0000000000 ) // hex10
    hex ( 29 20 23 30 36 37 38 39 ) ( 41 60 28 ) simpleGrading ( 1.0000000000 0.4346884374 0.3615953720 ) // hex11
    hex ( 29 36 39 30 1 32 35 2 ) ( 28 60 41 ) simpleGrading ( 0.3615953720 0.4346884374 1.0000000000 ) // hex12

    hex ( 40 41 42 43 32 33 34 35 ) ( 41 60 14 ) simpleGrading ( 1.0000000000 0.4346884374 0.8045764617 ) // hex13
    hex ( 45 37 38 46 41 33 34 42 ) ( 14 60 41 ) simpleGrading ( 0.8045764617 0.4346884374 1.0000000000 ) // hex14
    hex ( 36 37 38 39 44 45 46 47 ) ( 41 60 14 ) simpleGrading ( 1.0000000000 0.4346884374 1.2428899522 ) // hex15
    hex ( 36 44 47 39 32 40 43 35 ) ( 14 60 41 ) simpleGrading ( 1.2428899522 0.4346884374 1.0000000000 ) // hex16

    hex ( 44 45 46 47 40 41 42 43 ) ( 41 60 41 ) simpleGrading ( 1.0000000000 0.4346884374 1.0000000000 ) // hex17

    // piece 2
    hex ( 3 2 49 48 7 6 53 52 ) ( 60 100 45 ) simpleGrading ( 0.3923717513 1.0000000000 1.9071431203 ) // hex18
    hex ( 11 10 57 56 15 14 61 60 ) ( 60 100 45 ) simpleGrading ( 2.5486034526 1.0000000000 1.9071431203 ) // hex19
    hex ( 19 18 65 64 23 22 69 68 ) ( 60 100 35 ) simpleGrading ( 2.5486034526 1.0000000000 0.5854299325 ) // hex20
    hex ( 27 26 73 72 31 30 77 76 ) ( 60 100 35 ) simpleGrading ( 0.3923717513 1.0000000000 0.5854299325 ) // hex21

    hex ( 2 11 56 49 6 15 60 53 ) ( 41 100 45 ) simpleGrading ( 1.0000000000 1.0000000000 1.9071431203 ) // hex22
    hex ( 23 22 69 68 11 10 57 56 ) ( 60 100 41 ) simpleGrading ( 2.5486034526 1.0000000000 1.0000000000 ) // hex23
    hex ( 26 19 64 73 30 23 68 77 ) ( 41 100 35 ) simpleGrading ( 1.0000000000 1.0000000000 0.5854299325 ) // hex24
    hex ( 31 30 77 76 3 2 49 48 ) ( 60 100 41 ) simpleGrading ( 0.3923717513 1.0000000000 1.0000000000 ) // hex25

    hex ( 35 34 81 80 2 11 56 49 ) ( 41 100 28 ) simpleGrading ( 1.0000000000 1.0000000000 2.7655221204 ) // hex26
    hex ( 38 23 68 85 34 11 56 81 ) ( 28 100 41 ) simpleGrading ( 2.7655221204 1.0000000000 1.0000000000 ) // hex27
    hex ( 30 23 68 77 39 38 85 84 ) ( 41 100 28 ) simpleGrading ( 1.0000000000 1.0000000000 0.3615953720 ) // hex28
    hex ( 30 39 84 77 2 35 80 49 ) ( 28 100 41 ) simpleGrading ( 0.3615953720 1.0000000000 1.0000000000 ) // hex29

    // piece 3
    hex ( 48 49 50 51 52 53 54 55 ) ( 60 60 45 ) simpleGrading ( 0.3923717513 2.3004982739 1.9071431203 ) // hex30
    hex ( 56 57 58 59 60 61 62 63 ) ( 60 60 45 ) simpleGrading ( 2.5486034526 2.3004982739 1.9071431203 ) // hex31
    hex ( 64 65 66 67 68 69 70 71 ) ( 60 60 35 ) simpleGrading ( 2.5486034526 2.3004982739 0.5854299325 ) // hex32
    hex ( 72 73 74 75 76 77 78 79 ) ( 60 60 35 ) simpleGrading ( 0.3923717513 2.3004982739 0.5854299325 ) // hex33

    hex ( 49 56 59 50 53 60 63 54 ) ( 41 60 45 ) simpleGrading ( 1.0000000000 2.3004982739 1.9071431203 ) // hex34
    hex ( 68 69 70 71 56 57 58 59 ) ( 60 60 41 ) simpleGrading ( 2.5486034526 2.3004982739 1.0000000000 ) // hex35
    hex ( 73 64 67 74 77 68 71 78 ) ( 41 60 35 ) simpleGrading ( 1.0000000000 2.3004982739 0.5854299325 ) // hex36
    hex ( 76 77 78 79 48 49 50 51 ) ( 60 60 41 ) simpleGrading ( 0.3923717513 2.3004982739 1.0000000000 ) // hex37

    hex ( 80 81 82 83 49 56 59 50 ) ( 41 60 28 ) simpleGrading ( 1.0000000000 2.3004982739 2.7655221204 ) // hex38
    hex ( 85 68 71 86 81 56 59 82 ) ( 28 60 41 ) simpleGrading ( 2.7655221204 2.3004982739 1.0000000000 ) // hex39
    hex ( 77 68 71 78 84 85 86 87 ) ( 41 60 28 ) simpleGrading ( 1.0000000000 2.3004982739 0.3615953720 ) // hex40
    hex ( 77 84 87 78 49 80 83 50 ) ( 28 60 41 ) simpleGrading ( 0.3615953720 2.3004982739 1.0000000000 ) // hex41

    hex ( 88 89 90 91 80 81 82 83 ) ( 41 60 14 ) simpleGrading ( 1.0000000000 2.3004982739 0.8045764617 ) // hex42
    hex ( 93 85 86 94 89 81 82 90 ) ( 14 60 41 ) simpleGrading ( 0.8045764617 2.3004982739 1.0000000000 ) // hex43
    hex ( 84 85 86 87 92 93 94 95 ) ( 41 60 14 ) simpleGrading ( 1.0000000000 2.3004982739 1.2428899522 ) // hex44
    hex ( 84 92 95 87 80 88 91 83 ) ( 14 60 41 ) simpleGrading ( 1.2428899522 2.3004982739 1.0000000000 ) // hex45

    hex ( 92 93 94 95 88 89 90 91 ) ( 41 60 41 ) simpleGrading ( 1.0000000000 2.3004982739 1.0000000000 ) // hex46
);

edges
(
    // piece 1
    arc 1 8 ( 0.0000000000 -0.4600000000 0.2025000000 ) // hex5, hex9
    arc 2 11 ( 0.0000000000 -0.1600000000 0.2025000000 )

    arc 8 20 ( 0.1500000000 -0.4600000000 0.0525000000 ) // hex6, hex10
    arc 11 23 ( 0.1500000000 -0.1600000000 0.0525000000 )

    arc 29 20 ( 0.0000000000 -0.4600000000 -0.0975000000 ) // hex7, hex11
    arc 30 23 ( 0.0000000000 -0.1600000000 -0.0975000000 )

    arc 1 29 ( -0.1500000000 -0.4600000000 0.0525000000 ) // hex8, hex12
    arc 2 30 ( -0.1500000000 -0.1600000000 0.0525000000 )

    arc 32 33 ( 0.0000000000 -0.4600000000 0.1050000000 ) // hex9, hex13
    arc 35 34 ( 0.0000000000 -0.1600000000 0.1050000000 )

    arc 36 37 ( 0.0000000000 -0.4600000000 0.0000000000 ) // hex11, hex15
    arc 39 38 ( 0.0000000000 -0.1600000000 0.0000000000 )

    arc 33 37 ( 0.0525000000 -0.4600000000 0.0525000000 ) // hex10, hex14
    arc 34 38 ( 0.0525000000 -0.1600000000 0.0525000000 )

    arc 32 36 ( -0.0525000000 -0.4600000000 0.0525000000 ) // hex12, hex16
    arc 35 39 ( -0.0525000000 -0.1600000000 0.0525000000 )

    // piece 3
    arc 49 56 ( 0.0000000000 0.1600000000 0.2025000000 ) // hex34, hex38
    arc 50 59 ( 0.0000000000 0.4600000000 0.2025000000 )

    arc 56 68 ( 0.1500000000 0.1600000000 0.0525000000 ) // hex35, hex39
    arc 59 71 ( 0.1500000000 0.4600000000 0.0525000000 )

    arc 77 68 ( 0.0000000000 0.1600000000 -0.0975000000 ) // hex36, hex40
    arc 78 71 ( 0.0000000000 0.4600000000 -0.0975000000 )

    arc 49 77 ( -0.1500000000 0.1600000000 0.0525000000 ) // hex37, hex41
    arc 50 78 ( -0.1500000000 0.4600000000 0.0525000000 )

    arc 80 81 ( 0.0000000000 0.1600000000 0.1050000000 ) // hex38, hex42
    arc 83 82 ( 0.0000000000 0.4600000000 0.1050000000 )

    arc 84 85 ( 0.0000000000 0.1600000000 0.0000000000 ) // hex40, hex44
    arc 87 86 ( 0.0000000000 0.4600000000 0.0000000000 )

    arc 81 85 ( 0.0525000000 0.1600000000 0.0525000000 ) // hex39, hex43
    arc 82 86 ( 0.0525000000 0.4600000000 0.0525000000 )

    arc 80 84 ( -0.0525000000 0.1600000000 0.0525000000 ) // hex41, hex45
    arc 83 87  ( -0.0525000000 0.4600000000 0.0525000000 )
);

patches
(
    patch inlet_0
    (
        ( 0 4 7 3 ) // hex1
        ( 28 0 3 31 ) // hex8
        ( 24 28 31 27 ) // hex4

        ( 3 7 52 48 ) // hex18
        ( 31 3 48 76 ) // hex25
        ( 27 31 76 72 ) // hex21

        ( 51 48 52 55 ) // hex30
        ( 79 76 48 51 ) // hex37
        ( 75 72 76 79 ) // hex33
    )

    patch outlet_0
    (
        ( 9 10 14 13 ) // hex2
        ( 21 22 10 9 ) // hex6
        ( 17 18 22 21 ) // hex3

        ( 10 57 61 14 ) // hex19
        ( 22 69 57 10 ) // hex23
        ( 18 65 69 22 ) // hex20

        ( 58 57 61 62 ) // hex31
        ( 70 69 57 58 ) // hex35
        ( 66 65 69 70 ) // hex32
    )

    patch lateralfront_0
    (
        ( 0 1 5 4 ) // hex1
        ( 1 8 12 5 ) // hex5
        ( 8 9 13 12 ) // hex2
        ( 28 29 1 0 ) // hex8
        ( 20 21 9 8 ) // hex6
        ( 24 25 29 28 ) // hex4
        ( 25 16 20 29 ) // hex7
        ( 16 17 21 20 ) // hex3
        ( 32 33 8 1 ) // hex9
        ( 37 20 8 33 ) // hex10
        ( 29 20 37 36 ) // hex11
        ( 29 36 32 1 ) // hex12
        ( 40 41 33 32 ) // hex13
        ( 45 37 33 41 ) // hex14
        ( 36 37 45 44 ) // hex15
        ( 36 44 40 32 ) // hex16
        ( 44 45 41 40 ) // hex17
    )

    patch lateralback_0
    (
        ( 50 51 55 54 ) // hex30
        ( 59 50 54 63 ) // hex34
        ( 58 59 63 62 ) // hex31
        ( 70 71 59 58 ) // hex35
        ( 66 67 71 70 ) // hex32
        ( 67 74 78 71 ) // hex36
        ( 74 75 79 78 ) // hex33
        ( 78 79 51 50 ) // hex37
        ( 82 83 50 59 ) // hex38
        ( 71 86 82 59 ) // hex39
        ( 71 78 87 86 ) // hex40
        ( 87 78 50 83 ) // hex41
        ( 90 91 83 82 ) // hex42
        ( 86 94 90 82 ) // hex43
        ( 86 87 95 94 ) // hex44
        ( 95 87 83 91 ) // hex45
        ( 94 95 91 90 ) // hex46
    )

    patch surface_0
    (
        ( 4 5 6 7 ) // hex1
        ( 5 12 15 6 ) // hex5
        ( 12 13 14 15 ) // hex2

        ( 7 6 53 52 ) // hex18
        ( 6 15 60 53 ) // hex22
        ( 15 14 61 60 ) // hex19

        ( 53 52 55 54 ) // hex30
        ( 60 53 54 63 ) // hex34
        ( 61 60 63 62 ) // hex31
    )

    patch bottom_0
    (
        ( 24 25 26 27 ) // hex4
        ( 25 16 19 26 ) // hex7
        ( 16 17 18 19 ) // hex3

        ( 27 26 73 72 ) // hex21
        ( 26 19 64 73 ) // hex24
        ( 19 18 65 64 ) // hex20

        ( 73 72 75 74 ) // hex33
        ( 64 73 74 67 ) // hex36
        ( 65 64 67 66 ) // hex32
    )

    patch cylinder_0
    (
        ( 42 43 35 34 ) // hex13
        ( 38 46 42 34 ) // hex14
        ( 38 39 47 46 ) // hex15
        ( 47 39 35 43 ) // hex16
        ( 46 47 43 42 ) // hex17

        ( 35 34 81 80 ) // hex26
        ( 85 81 34 38 ) // hex27
        ( 38 39 84 85 ) // hex28
        ( 80 84 39 35 ) // hex29

        ( 89 88 80 81 ) // hex42
        ( 85 93 89 81 ) // hex43
        ( 85 84 92 93 ) // hex44
        ( 92 84 80 88 ) // hex45
        ( 93 92 88 89 ) // hex46
    )
);

mergePatchPairs
(
);
