Case1_3DCS49_FineMesh_kEpsilon/0_org/pff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 0;
    }
    lateralfront
    {
        type            zeroGradient;    
//        type            calculated;
//        value           uniform 0;
    }
    lateralback
    {
        type            zeroGradient;    
//        type            calculated;
//        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 0;
    }
    surface
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 0;
//        type            symmetryPlane;
    }
}


// ************************************************************************* //
